from aiogram import Router


user_router = Router()



EMOJI_SET = {
    "greeting": ["👋", "🤗", "😊", "✌️", "🙌"],
    "catalog": ["🛒", "🏍️", "🚵", "🛵", "🏎️"],
    "cart": ["🛍️", "💼", "🧺", "🎁"],
    "orders": ["📋", "📝", "📑", "🧾"],
    "admin": ["👨‍💼", "👩‍💼", "🔑", "⚙️"],
    "success": ["✅", "🎉", "👍", "💯"],
    "waiting": ["⏳", "⌛", "🕒", "⏱️"],
}


GREETINGS = [
    "Привіт, {}! Радий тебе бачити! {}",
    "Вітаю, {}! Сподіваюся, у тебе все добре! {}",
    "Здоров був, {}! Як ся маєш? {}",
    "Салют, {}! Чудово, що завітав до нас! {}",
    "Привітики, {}! Готовий до крутих покупок? {}"
]